#include "item.h"

Item::Item()
{

    name_list[0]={-4500,-3000,6,"红山文化玉龙凤佩","出土于牛河梁遗址第二地点一号冢23号墓。整体呈黄绿色，局部有少量黄褐色瑕斑；正面以减地阳纹与较粗的阴线雕出一龙一凤，均为头部，雕刻清晰，身体简化；龙吻部前凸、长舌圆睛，凤首高冠圆睛，喙部上扬；二者依附交缠，生动传神，设计极具巧思。",1};
    name_list[1]={-4500,-3000,6,"红山文化玉鳖","出土于牛河梁遗址第五地点1号墓。两件玉鳖分别出土于墓主人左、右手部位（左手部位为雌鳖，右手部位为雄鳖）；两鳖皆呈黄绿色，首部形状近于三角形，以起地阳纹和短阴线技法雕出目和口；颈部微缩，屈肢，有尾，背稍凸起，平腹。",1};
    name_list[2]={-4500,-3000,6,"红山文化玉猪龙","出土于牛河梁遗址第二地点一号冢4号墓。两件玉猪龙向背平置于墓主人胸前，其中一件呈淡绿色，通体精磨，光泽圆润，龙体卷曲如环，头部呈兽首形，短立耳较大，两耳之间从额中到头顶起短棱脊，目圆而稍鼓，吻部前凸，有鼻孔，口略张开；另一件为白色蛇纹岩质，形制基本相同，体型较小，头部刻画的线条甚为粗简。",1};
    name_list[3]={-4500,-3000,5,"红山文化陶塔形器","出土于牛河梁遗址第二地点二号冢，是牛河梁遗址唯一可复原的塔形器。泥质红陶，有红陶衣；双口部，口上端残缺，可见口下起一凸棱；颈部呈椭圆形，腹部较鼓呈覆钵状，腹下部内收，腹面满压窝点纹，再施挂黑彩。",1};
    name_list[4]={-4500,-3000,4,"红山文化陶熏炉器盖","出土于牛河梁遗址第一地点女神庙。泥质红陶，陶质较细，火候甚高，质地坚硬，薄厚均匀；形如倒置的豆，柄呈喇叭状，盖的沿腹间起明显折棱；盖面有四组长条状镂孔，每组5条，间距相等，以中间孔最长。",1};
    name_list[5]={-4500,-3000,5,"红山文化玉人","出土于牛河梁遗址第十六地点4号墓。玉人为立姿，正面半圆雕，头部方圆，双眼微合，嘴巴半张，额间凹陷表情呈痴迷状态。双臂曲肘，双手立于胸前，双腿并足而立，脐下部位凸鼓，似为巫师站立祈祷的形象。",1};
    name_list[6]={-4500,-3000,4,"红山文化玉斜口筒形器","出土于牛河梁遗址第二地点一号冢25号墓。器表为青绿色，整体呈扁圆筒状。一端作斜口，口大而外敞；一端作平口，开口较小。上下口沿的沿面均磨平，或磨薄似刀刃。接近下口沿的长径两侧，有由外向内单面钻出的双孔，内壁可见掏取内芯时遗留的线切割痕迹。",1};
    name_list[7]={-3500,-3100,6,"古埃及彩绘双耳陶罐","古埃及的前王朝时期，通常被划分为涅伽达文化三阶段：第一阶段又叫「阿姆拉特时期」，第二阶段又叫「格尔津时期」，第三阶段被视为「第零王朝」。「格尔津时期」的墓葬中，被发掘出了许多带有暗红图案的棕黄陶罐。双耳陶罐上绘有一艘带有两个舱的大船，有桅杆和密集的竖桨，船头有棕榈树装饰。",1};
    name_list[8]={-3200,-3000,6,"古埃及纳尔迈调色板","世上最古老的历史文献。古埃及人用调色板研磨矿石，制成深色眼妆涂在眼睑周围，降低眩光，防治眼疾。一些雕刻精美的调色板，有宗教祭祀的功能。",1};
    name_list[9]={-2575,-2551,4,"古埃及美杜姆群鹅图","斯尼夫鲁是古埃及第四王朝的创立者，「美杜姆群鹅图」是他长子墓中墙面上的石膏装饰，是一幅完整壁画中的残片。壁画由工匠在墙面雕刻，再填以颜料。画面中两种鹅对称分布，据考证，它们可能来自当时的希腊和土耳其。",1};
    name_list[10]={-1781,-1550,3,"古埃及河马","第二中间时期的墓葬中，湖蓝色珐琅质地的河马雕像，河马一度被古埃及人奉为神明，雄性河马有着强大的破坏性，相传古埃及历史上第一位法老就是被河马杀死的。雌性河马为保护子女表现出的勇气更令人敬畏，因此生育女神Taweret的形象就是河马。河马雕塑也被古埃及人视为驱散恶灵，帮助死者重生的灵物，它身上画的莲花图案也有重生的寓意。",1};
    name_list[11]={-945,-924,4,"古埃及舍顺克二世臂环","舍顺克二世是古埃及第二十二王朝的统治者，他的遗骸上戴着黄金面具，精美的胸饰以及一对由金子、宝石、肉红玉髓、白色珐琅和天青石制作的臂环。臂环上有着「荷鲁斯之眼」。相传鹰神荷鲁斯的左眼代表月亮，右眼代表太阳。荷鲁斯之眼作为陪葬饰物，有驱邪和保佑重生的寓意。",1};
    name_list[12]={-1333,-1323,6,"古埃及图坦卡蒙黄金面具","图坦卡蒙是阿肯那吞和纳芙蒂蒂的儿子.面具由金箔制成，嵌有宝石和彩色玻璃。前额部分饰有鹰神和眼镜蛇神，象征上、下埃及（上埃及以神鹰为保护神，下埃及以蛇神为保护神）；下面垂着胡须，象征冥神奥西里斯。在古埃及宗教信仰中，面具被认为是令法老重生或永生的神圣道具。",1};
    name_list[13]={-196,-196,6,"古埃及罗塞塔石碑","罗塞塔石碑上，用古埃及象形文字、埃及草书和希腊语三种字体，刻着托勒密五世的诏书。1799年，随拿破仑攻入埃及的一名上尉，在埃及港口城市罗塞塔发现了这块石碑。它是破译失传千年的古埃及象形文字的秘钥。",1};
    name_list[14]={-2465,-2458,4,"古埃及祭司木雕像","这位叫Kaaper的男子，是古埃及第五王朝乌瑟卡夫时期一位颇具地位的祭司和书吏。雕像呈现出了他肥胖的身材和圆润的面型，嘴角隐约有几分慈祥的笑容。他的眼睛由石英和水晶制成，原本覆盖在身上的石膏和色彩已经脱落。作为一件木制品，能如此完整地保存下来已经非常难得了。",1};
    name_list[15]={-1792,-1750,6,"美索不达米亚汉谟拉比法典","《汉谟拉比法典》以楔形文字书写，共282条，涉及婚姻、家庭、就业和当时的其他问题。《法典》得到了神的认可；汉谟拉比以虔诚的姿态从沙玛什手中接过棍棒和戒指，沙玛什将权力赐予国王。沙玛什坐在王座之上，他肩上的波浪线显示了他的神性。汉谟拉比在太阳神面前几乎畏缩，这表明了当时巴比伦神权统治的本质。",1};
    name_list[16]={-4500,-3000,6,"美索不达米亚","",1};
    name_list[17]={-4500,-3000,6,"美索不达米亚","",1};
    name_list[18]={-4500,-3000,6,"美索不达米亚","",1};
    name_list[19]={-4500,-3000,6,"美索不达米亚","",1};
    name_list[20]={-4500,-3000,6,"红山文化玉龙凤佩","",1};
    name_list[21]={-4500,-3000,6,"红山文化玉龙凤佩","",1};
    name_list[22]={-4500,-3000,6,"红山文化玉龙凤佩","",1};
    name_list[23]={-4500,-3000,6,"红山文化玉龙凤佩","",1};
    name_list[24]={-4500,-3000,6,"红山文化玉龙凤佩","",1};
    name_list[25]={-4500,-3000,6,"红山文化玉龙凤佩","",1};
    name_list[26]={-4500,-3000,6,"红山文化玉龙凤佩","",1};
}
